pmo-dataset/variations/graphviz_with_ids/40.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Service_1" [label="Stop the machine"];
  "Service_2" [label="Send email to an\nengineer"];
  "Service_3" [label="Get availability\ndata"];
  "Service_4" [label="Get quality data"];
  "Service_5" [label="Get performance data"];
  "Service_6" [label="Calculate OEE"];
  "Manual_1" [label="Continue measuring"];
  "Manual_2" [label="Repair the issue"];
  "Manual_3" [label="Restart the machine"];
  "Manual_4" [label="Disconnect the\nmachine"];
  "StartNoneEvent_1" [shape=circle, label="OEE data required"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="Machine operating\nnormally / Machine\ndisconnected"];
  "ExclusiveGateway_1" [shape=diamond, label="OEE below 50%?"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="Machine worth\nrepairing?"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
  "ExclusiveGateway_5" [shape=diamond, label="Remaining issues?"];
  "ExclusiveGateway_6" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];

  "ParallelGateway_1" -> "Service_4";
  "ParallelGateway_1" -> "Service_3";
  "ParallelGateway_1" -> "Service_5";
  "Service_4" -> "ParallelGateway_2";
  "Service_3" -> "ParallelGateway_2";
  "Service_5" -> "ParallelGateway_2";
  "ParallelGateway_2" -> "Service_6";
  "ExclusiveGateway_1" -> "Service_1" [label="Yes"];
  "Service_1" -> "Service_2";
  "StartNoneEvent_1" -> "ParallelGateway_1";
  "Service_2" -> "ExclusiveGateway_3";
  "Manual_2" -> "ExclusiveGateway_5";
  "Manual_3" -> "Manual_1";
  "ExclusiveGateway_2" -> "EndNoneEvent_1";
  "Service_6" -> "ExclusiveGateway_1";
  "ExclusiveGateway_3" -> "Manual_4" [label="No"];
  "ExclusiveGateway_4" -> "ExclusiveGateway_2";
  "Manual_4" -> "ExclusiveGateway_4";
  "Manual_1" -> "ExclusiveGateway_4";
  "ExclusiveGateway_3" -> "ExclusiveGateway_6" [label="Yes"];
  "ExclusiveGateway_5" -> "Manual_3" [label="No"];
  "ExclusiveGateway_6" -> "Manual_2";
  "ExclusiveGateway_5" -> "ExclusiveGateway_6" [label="Yes"];
  "ExclusiveGateway_1" -> "ExclusiveGateway_2" [label="No"];
}
