pmo-dataset/variations/mermaid_with_ids/40.mmd
graph LR
	classDef endEvent stroke-width:3px
	Service_1["Stop the machine"]
	Service_2["Send email to an\nengineer"]
	Service_3["Get availability\ndata"]
	Service_4["Get quality data"]
	Service_5["Get performance data"]
	Service_6["Calculate OEE"]
	Manual_1["Continue measuring"]
	Manual_2["Repair the issue"]
	Manual_3["Restart the machine"]
	Manual_4["Disconnect the\nmachine"]
	StartNoneEvent_1(("OEE data required"))
	EndNoneEvent_1(("Machine operating\nnormally / Machine\ndisconnected")):::endEvent
	ExclusiveGateway_1{"OEE below 50%?"}
	ExclusiveGateway_2{"X"}
	ExclusiveGateway_3{"Machine worth\nrepairing?"}
	ExclusiveGateway_4{"X"}
	ExclusiveGateway_5{"Remaining issues?"}
	ExclusiveGateway_6{"X"}
	ParallelGateway_1{"+"}
	ParallelGateway_2{"+"}

	ParallelGateway_1 --> Service_4
	ParallelGateway_1 --> Service_3
	ParallelGateway_1 --> Service_5
	Service_4 --> ParallelGateway_2
	Service_3 --> ParallelGateway_2
	Service_5 --> ParallelGateway_2
	ParallelGateway_2 --> Service_6
	ExclusiveGateway_1 -->|"Yes"| Service_1
	Service_1 --> Service_2
	StartNoneEvent_1 --> ParallelGateway_1
	Service_2 --> ExclusiveGateway_3
	Manual_2 --> ExclusiveGateway_5
	Manual_3 --> Manual_1
	ExclusiveGateway_2 --> EndNoneEvent_1
	Service_6 --> ExclusiveGateway_1
	ExclusiveGateway_3 -->|"No"| Manual_4
	ExclusiveGateway_4 --> ExclusiveGateway_2
	Manual_4 --> ExclusiveGateway_4
	Manual_1 --> ExclusiveGateway_4
	ExclusiveGateway_3 -->|"Yes"| ExclusiveGateway_6
	ExclusiveGateway_5 -->|"No"| Manual_3
	ExclusiveGateway_6 --> Manual_2
	ExclusiveGateway_5 -->|"Yes"| ExclusiveGateway_6
	ExclusiveGateway_1 -->|"No"| ExclusiveGateway_2
